OF16ext/CR35_dambreak/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
   (0.0     0.0     0.0)
   (0.89    0.0     0.0)
   (0.89    0.0     0.58)
   (0.0     0.0     0.58)
   (0.0     0.02    0.0)
   (0.89    0.02    0.0)
   (0.89    0.02    0.58)
   (0.0     0.02    0.58)
);

blocks          
(
    hex (0 1 5 4 3 2 6 7)   (178 1 116) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall leftWall
    (
        (0 4 7 3)
    )
    wall rightWall
    (
        (1 5 6 2)
    )
    wall lowerWall
    (
        (0 1 5 4)
    )
    patch atmosphere
    (
        (3 2 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
